import org.junit.Test;

public class C_180_05357_CustomStackTest {
    C_180_05357_CustomStack c_05357 = new C_180_05357_CustomStack(3);

    @Test
    public void testPushMore() {
        c_05357.push(1);                       // 栈变为 [1]
        c_05357.push(2);                       // 栈变为 [1, 2]
        c_05357.pop();                            // 返回 2 --> 返回栈顶值 2，栈变为 [1]
        c_05357.push(2);                       // 栈变为 [1, 2]
        c_05357.push(3);                       // 栈变为 [1, 2, 3]
        c_05357.push(4);                       // 栈仍然是 [1, 2, 3]，不能添加其他元素使栈大小变为 4
        c_05357.increment(5, 100);         // 栈变为 [101, 102, 103]
        c_05357.increment(2, 100);         // 栈变为 [201, 202, 103]
        c_05357.pop();                            // 返回 103 --> 返回栈顶值 103，栈变为 [201, 202]
        c_05357.pop();                            // 返回 202 --> 返回栈顶值 202，栈变为 [201]
        c_05357.pop();                            // 返回 201 --> 返回栈顶值 201，栈变为 []
        c_05357.pop();                            // 返回 -1 --> 栈为空，返回 -1

    }
}
